W10D4/Project/reddit_clone/app/views/posts/new.html.erb

    Subs:
    <%Sub.all.each do |sub|%>
---
SELECT "subs".* FROM "subs"