W10D4/Project/reddit_clone/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "the post"], ["author_id", 1], ["created_at", "2019-10-10 21:36:27.020416"], ["updated_at", "2019-10-10 21:36:27.020416"]]
---
  def create
    @post = Post.new(post_params)
    @post.author_id = 1
    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "url" = $1, "content" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["url", "google"], ["content", "    \r\n    blah"], ["updated_at", "2019-10-10 22:41:39.583019"], ["id", 1]]
---
  def update
    @post = Post.find(params[:id])

    if @post.update(post_params)